---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeCalculationRules
source: html/5307bcb4-d0ad-a71e-b8a0-f76b004e02e4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeCalculationRules Property

"Calculation Rules": Calculation Rules

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeCalculationRules { get; }
```